In [28]:
import pandas as pd

In [29]:
companies = {
    'value': [220, 160, 140, 117, 94],
    'change': [17.5, 11.9, -8.5, -2.1, 3.5],
    'sector': ['retail', 'tech', 'tech', 'tech', 'tech']
}

data = pd.DataFrame(companies, index = ['Amazon', 'Google', 'Apple', 'Microsoft', 'Samsung'])
data

           value  change  sector
Amazon       220    17.5  retail
Google       160    11.9    tech
Apple        140    -8.5    tech
Microsoft    117    -2.1    tech
Samsung       94     3.5    tech

In [30]:
data.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, Amazon to Samsung
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   value   5 non-null      int64
 1   change  5 non-null      float64
 2   sector  5 non-null      object
dtypes: float64(1), int64(1), object(1)
memory usage: 160.0+ bytes

In [31]:
data.columns

Index(['value', 'change', 'sector'], dtype='object')

In [32]:
data.index

Index(['Amazon', 'Google', 'Apple', 'Microsoft', 'Samsung'], dtype='object')

In [33]:
data.describe()

            value     change
count    5.000000   5.000000
mean   146.200000   4.460000
std     48.095738  10.456003
min     94.000000  -8.500000
25%    117.000000  -2.100000
50%    140.000000   3.500000
75%    160.000000  11.900000
max    220.000000  17.500000

In [34]:
data.loc[data['value'] > 150]

        value  change  sector
Amazon    220    17.5  retail
Google    160    11.9    tech

In [35]:
data['change']

Amazon       17.5
Google       11.9
Apple        -8.5
Microsoft    -2.1
Samsung       3.5
Name: change, dtype: float64

In [36]:
data

           value  change  sector
Amazon       220    17.5  retail
Google       160    11.9    tech
Apple        140    -8.5    tech
Microsoft    117    -2.1    tech
Samsung       94     3.5    tech

In [37]:
data.iloc[3]

value      117
change    -2.1
sector    tech
Name: Microsoft, dtype: object

In [38]:
data.iloc[1:4, 1:3]

           change sector
Google       11.9   tech
Apple        -8.5   tech
Microsoft    -2.1   tech

In [39]:
data[0:3]

        value  change  sector
Amazon    220    17.5  retail
Google    160    11.9    tech
Apple     140    -8.5    tech

In [40]:
data['Amazon':'Microsoft']

           value  change  sector
Amazon       220    17.5  retail
Google       160    11.9    tech
Apple        140    -8.5    tech
Microsoft    117    -2.1    tech

In [41]:
data

           value  change  sector
Amazon       220    17.5  retail
Google       160    11.9    tech
Apple        140    -8.5    tech
Microsoft    117    -2.1    tech
Samsung       94     3.5    tech

In [42]:
data['value'].mul(2)

Amazon       440
Google       320
Apple        280
Microsoft    234
Samsung      188
Name: value, dtype: int64

In [43]:
data['value'].sub(2)

Amazon       218
Google       158
Apple        138
Microsoft    115
Samsung       92
Name: value, dtype: int64

In [44]:
data['value'].add(2)

Amazon       222
Google       162
Apple        142
Microsoft    119
Samsung       96
Name: value, dtype: int64

In [45]:
div, rem = divmod(data['value'], 2)
div, rem

(Amazon       110
 Google        80
 Apple         70
 Microsoft     58
 Samsung       47
 Name: value, dtype: int64, Amazon       0
 Google       0
 Apple        0
 Microsoft    1
 Samsung      0
 Name: value, dtype: int64)

In [46]:
data

           value  change  sector
Amazon       220    17.5  retail
Google       160    11.9    tech
Apple        140    -8.5    tech
Microsoft    117    -2.1    tech
Samsung       94     3.5    tech

In [47]:
data.mean()

value     146.20
change      4.46
dtype: float64

In [48]:
data.sum(0)

value                        731
change                      22.3
sector    retailtechtechtechtech
dtype: object

In [49]:
data.sum(1)

Amazon       237.5
Google       171.9
Apple        131.5
Microsoft    114.9
Samsung       97.5
dtype: float64

In [50]:
data.std()

value     48.095738
change    10.456003
dtype: float64

In [51]:
data.quantile(.5)

value     140.0
change      3.5
Name: 0.5, dtype: float64

In [52]:
data.min()

value         94
change      -8.5
sector    retail
dtype: object

In [53]:
data.cumsum()

           value  change                  sector
Amazon       220    17.5                  retail
Google       380    29.4              retailtech
Apple        520    20.9          retailtechtech
Microsoft    637    18.8      retailtechtechtech
Samsung      731    22.3  retailtechtechtechtech

In [54]:
data.count()

value     5
change    5
sector    5
dtype: int64